In [2]:
import numpy as np
import pandas as pd

In [4]:
index = pd.date_range('1/1/2000', periods=8)

s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
df = pd.DataFrame(np.random.randn(8, 3), index=index,
                   columns=['A', 'B', 'C'])

In [5]:
df[:2]

                   A         B         C
2000-01-01  0.429436 -0.076749  1.911331
2000-01-02 -0.206314  1.542305  0.549078

In [6]:
df

                   A         B         C
2000-01-01  0.429436 -0.076749  1.911331
2000-01-02 -0.206314  1.542305  0.549078
2000-01-03  0.616381  1.110890  0.571106
2000-01-04 -0.804967  0.259031  0.739314
2000-01-05 -1.584860  1.262689 -0.300555
2000-01-06  0.693541  0.720975  0.235661
2000-01-07 -0.644451  1.242918 -0.570781
2000-01-08 -0.355706 -0.015670 -0.895783

In [7]:
df.columns = [x.lower() for x in df.columns]

In [8]:
df

                   a         b         c
2000-01-01  0.429436 -0.076749  1.911331
2000-01-02 -0.206314  1.542305  0.549078
2000-01-03  0.616381  1.110890  0.571106
2000-01-04 -0.804967  0.259031  0.739314
2000-01-05 -1.584860  1.262689 -0.300555
2000-01-06  0.693541  0.720975  0.235661
2000-01-07 -0.644451  1.242918 -0.570781
2000-01-08 -0.355706 -0.015670 -0.895783

In [9]:
s.array

<PandasArray>
[ 0.5545667577214696, 0.10741598977661841, -1.2825904905702685,
   1.913368631446538,  0.5207718795227035]
Length: 5, dtype: float64

In [10]:
s.index.array

<PandasArray>
['a', 'b', 'c', 'd', 'e']
Length: 5, dtype: object

In [11]:
df = pd.DataFrame({
     'one': pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
     'two': pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd']),
     'three': pd.Series(np.random.randn(3), index=['b', 'c', 'd'])})

df

        one       two     three
a  0.325540 -0.231307       NaN
b -0.040766  0.156861 -0.551419
c  0.465005 -0.072894  1.308151
d       NaN  1.470419  0.399063

In [15]:
row = df.iloc[1]
column = df['two']
df.sub(row, axis='columns')

        one       two     three
a  0.366305 -0.388168       NaN
b  0.000000  0.000000  0.000000
c  0.505770 -0.229756  1.859570
d       NaN  1.313558  0.950482

In [16]:
df.sub(row, axis=1)

        one       two     three
a  0.366305 -0.388168       NaN
b  0.000000  0.000000  0.000000
c  0.505770 -0.229756  1.859570
d       NaN  1.313558  0.950482

In [17]:
df.sub(column, axis='index')

        one  two     three
a  0.556847  0.0       NaN
b -0.197627  0.0 -0.708280
c  0.537899  0.0  1.381046
d       NaN  0.0 -1.071356

In [18]:
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
s

a   -0.575530
b    2.298036
c    0.925877
d    1.041448
e   -0.356987
dtype: float64

In [19]:
s.reindex(['e', 'b', 'f', 'd'])

e   -0.356987
b    2.298036
f         NaN
d    1.041448
dtype: float64

In [20]:
s

a   -0.575530
b    2.298036
c    0.925877
d    1.041448
e   -0.356987
dtype: float64

In [21]:
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])

In [23]:
s1 = s[:4]
s1

a    0.560053
b    0.032164
c   -0.711960
d    0.155868
dtype: float64

In [24]:
s2 = s[1:]
s2

b    0.032164
c   -0.711960
d    0.155868
e   -0.904305
dtype: float64

In [25]:
s1.align(s2)

(a    0.560053
 b    0.032164
 c   -0.711960
 d    0.155868
 e         NaN
 dtype: float64, a         NaN
 b    0.032164
 c   -0.711960
 d    0.155868
 e   -0.904305
 dtype: float64)

In [26]:
s1.align(s2, join='inner')

(b    0.032164
 c   -0.711960
 d    0.155868
 dtype: float64, b    0.032164
 c   -0.711960
 d    0.155868
 dtype: float64)

In [27]:
s1.align(s2, join='left')

(a    0.560053
 b    0.032164
 c   -0.711960
 d    0.155868
 dtype: float64, a         NaN
 b    0.032164
 c   -0.711960
 d    0.155868
 dtype: float64)

In [28]:
df = pd.DataFrame({'a': [1, 2, 3], 'b': ['a', 'b', 'c']})
df

   a  b
0  1  a
1  2  b
2  3  c

In [32]:
for row_index, row in df.iterrows():
     print(row_index, row, sep='-》')

0-》a    1
b    a
Name: 0, dtype: object
1-》a    2
b    b
Name: 1, dtype: object
2-》a    3
b    c
Name: 2, dtype: object